/******************************************************************************

                            Online C Compiler.
                Code, Compile, Run and Debug C program online.
Write your code in this editor and press "Run" button to compile and execute it.

*******************************************************************************/

/*
이 문제는 결국 m=0을 만들어 n+1을 구하는 문제이다.

*** 반복프로그램 ***
if(n==0) n=1 // return A(m-1,1)의 1을 구현
else n = A2(m,n-1) // return A(m-1, A(m,n-1))의 A(m,n-1)을 구현
위 else문을 끝까지 구하고나서 m=m-1코드가 실행되고 다시반복 ==> return A(m-1, A(m,n-1))의 구현*/
#include <stdio.h>

int A(int m, int n){
    if(m==0) return n+1;
    if(n==0) return A(m-1,1);
    return A(m-1, A(m, n-1));
}

int A2(int m, int n){
	while (m != 0) {
		if (n == 0)	n = 1;
		else n = A2(m, n - 1);
		m = m - 1;
	}
	return n + 1;
}

int main()
{
    int a = A2(2,3);
    printf("%d",a);

    return 0;
}
/*                                             
A(3,2) = A(2, A(3,1)) = A(2,7)
A(3,1) = A(2, A(3,0)) = A(2,3) = A(1, A(2,2)) = A(1,5) = A(0, A(1,4))= A(1,4)+1 = A(0, A(1,3))+1 = A(1,3)+2 = A(0, A(1,2))+2 = A(1,2)+3 = A(0, A(1,1))+3 = A(1,1)+4 = A(0, A(1,0))+4 = A(1,0)+5 = A(0,1)+5 = 7
                                                                                                           
A(3,0) = A(2,1) = A(1, A(2,0)) = A(1, A(1, 1))
A(1,1) = A(0, A(1, 0)) = A(1,0)+1 = A(0,1)+1 = 3

A(2,2) = A(1, A(2,1)) = A(1,4) = A(0, A(1,3)) = A(1,3)+1 = A(0, A(1,2))+1 = A(1,2)+1+1 = A(0, A(1,1))+2 = A(0,3)+2 = 5
A(2,1) = A(1, A(2,0)) = A(1, A(1,1)) = A(1,3) = A(0, A(1,2)) = A(1,2)+1 = A(0, A(1,1))+1 = A(0,3)+1 = 4
A(1,1) = A(0, A(1,0)) = A(1,0)+1 = A(0,1)+1 = 3

A(2,7) = A(1, A(2,6))
A(2,6) = A(1, A(2,5))
A(2,5) = A(1, A())
*/
